---
kind: type
id: T:Autodesk.Revit.DB.FamilyPlacementType
source: html/2abb8627-1da3-4069-05c9-19e4be5e02ad.htm
---
# Autodesk.Revit.DB.FamilyPlacementType

The type of placement required for a given family.

## Syntax (C#)
```csharp
public enum FamilyPlacementType
```